## Import Library

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Read data

In [3]:
# read the training dataset from Kaggle's Titanic competition into a DataFrame
train = pd.read_csv('titanic/train.csv')

In [4]:
train.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## Read test data

In [7]:
# read the testing dataset from Kaggle's Titanic competition into a DataFrame
test = pd.read_csv('titanic/test.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Drop Object columns

In [8]:
train = train.drop(columns=['Name','Ticket','Cabin'])

In [9]:
train.head(3)

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S

In [10]:
train.Embarked = train.Embarked.fillna('S')

In [11]:
y_train = train.pop('Survived')
y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [12]:
y_train.shape

(891,)

# Preprocessing

In [13]:
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.impute import SimpleImputer

num_pipeline = Pipeline([
        ('imputer', SimpleImputer(strategy="median")),
        ('std_scaler', StandardScaler()),
    ])

In [14]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

num_attribs = ['PassengerId','Pclass','Age','SibSp', 'Parch', 'Fare']
cat_attribs = ['Sex','Embarked']

enc_pipeline = ColumnTransformer([
        ("num", num_pipeline, num_attribs),
        ("cat", OneHotEncoder(), cat_attribs),
    ])

X_train = enc_pipeline.fit_transform(train)

In [15]:
X_train.shape

(891, 11)

In [16]:
X_train = pd.DataFrame(X_train)
X_train.head()

,0,1,2,3,4,5,6,7,8,9,10
0,-1.730108,0.827377,-0.565736,0.432793,-0.473674,-0.502445,0.0,1.0,0.0,0.0,1.0
1,-1.726220,-1.566107,0.663861,0.432793,-0.473674,0.786845,1.0,0.0,1.0,0.0,0.0
2,-1.722332,0.827377,-0.258337,-0.474545,-0.473674,-0.488854,1.0,0.0,0.0,0.0,1.0
3,-1.718444,-1.566107,0.433312,0.432793,-0.473674,0.420730,1.0,0.0,0.0,0.0,1.0
4,-1.714556,0.827377,0.433312,-0.474545,-0.473674,-0.486337,0.0,1.0,0.0,0.0,1.0

# Try Feature Selection + RF

In [19]:
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler
from sklearn.feature_selection import SelectFromModel
from sklearn.svm import LinearSVC
from sklearn.svm import SVC

# create the pipeline
clf = Pipeline([
  ('feature_selection', SelectFromModel(LinearSVC(C=10, penalty='l1', dual=False, max_iter=5000))),
  ('classification', SVC(kernel='rbf'))
])

In [20]:
from sklearn.model_selection import GridSearchCV

# perform GridSearch

param_grid = [
    {'feature_selection__estimator__C': [1,10,50,100,500,1000], 'classification__kernel': ['linear', 'poly', 'rbf', 'sigmoid']},    
  ]

grid_search_fs = GridSearchCV(estimator = clf,
                           param_grid = param_grid,
                           scoring = 'accuracy',
                           cv = 5,
                           n_jobs = -1)

grid_search_fs = grid_search_fs.fit(X_train, y_train)

/Users/nhanph/anaconda3/lib/python3.7/site-packages/sklearn/svm/base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [21]:
grid_search_fs.best_score_

0.8294051627384961

# Read Test Data

In [22]:
# read the testing dataset from Kaggle's Titanic competition into a DataFrame
test = pd.read_csv('titanic/test.csv')

In [23]:
# drop columns
test = test.drop(columns=['Name','Ticket','Cabin'])
test.Embarked = test.Embarked.fillna('S')

In [24]:
X_test = enc_pipeline.fit_transform(test)
y_test = grid_search_fs.best_estimator_.predict(X_test)

## Generate submission

In [25]:
# ensure that PassengerID is the first column by setting it as the index
submission = pd.DataFrame({'PassengerId':test.PassengerId, 'Survived':y_test}).set_index('PassengerId')
submission.head()

             Survived
PassengerId
892                 0
893                 1
894                 0
895                 0
896                 1

In [26]:
submission.shape

(418, 1)

In [27]:
# output to csv
submission.to_csv('submission_NhanPham.csv')